# Задание "Слишком древний шифр"

print('_________________________________________________________________________________')
print('Доброго времени суток, ИндианаПупс! Угадай древний шифр, выбрав число от 3 до 20.')
print('_________________________________________________________________________________')

n = int(input('Введи число, которое возможно сохранит тебе жизнь: '))
print('                                                            ')
a = [1, 2, 3 ,4 ,5 ,6 ,7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
b = [1, 2, 3 ,4 ,5 ,6 ,7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
pole_2 = []

for i in range(len(a)):
    if n == a[i]:
        continue
    for j in range(a[i], len(b)):
        if a[i] == b[j]:
            continue
        if n == b[j]:
            continue
        if n % (a[i] + b[j]) == 0:
            pole_2.append(a[i])
            pole_2.append(b[j])
        else:
            continue
print(f'Верный шифр, дерзай: {pole_2}')